In [1]:
import pandas as pd

In [8]:
#Creating dataframe using pd.DataFrame
mydataset = {
    'cars': ["BMW", "Volvo", "Ford"],
    'passings': [3,7,3]
}
myvar = pd.DataFrame(mydataset)
print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         3

In [9]:
print(pd.__version__)

1.2.4

In [10]:
#Creating series using pd.Series
a = [1,7,2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [11]:
print(myvar[1])

7

In [14]:
#Creating Series with customized index.
index = ["x", "y", "z"]
a = [1,7,2]
myvar = pd.Series(a, index=index)
print(myvar)

x    1
y    7
z    2
dtype: int64

In [16]:
#Creating series using dictionary
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [19]:
#Creating dataframe using dictionary.
data = {
    "calories": [420, 380, 390],
    "duration": [50, 40, 45]
}
myvar = pd.DataFrame(data)
print(myvar)

   calories  duration
0       420        50
1       380        40
2       390        45

In [22]:
print(myvar.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [25]:
print(myvar.loc[[0,1]])

   calories  duration
0       420        50
1       380        40

In [27]:
print("Day1: ")
print(myvar.loc[0])
print("Day2: ")
print(myvar.loc[1])
print("Day3: ")
print(myvar.loc[2])

Day1:
calories    420
duration     50
Name: 0, dtype: int64
Day2:
calories    380
duration     40
Name: 1, dtype: int64
Day3:
calories    390
duration     45
Name: 2, dtype: int64

In [33]:
df = pd.read_csv("Salaries.csv")
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[78 rows x 6 columns]

In [36]:
df.head()

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0
1  Prof          A  12.0        6  Male   93000.0
2  Prof          A  23.0       20  Male  110515.0
3  Prof          A  40.0       31  Male  131205.0
4  Prof          B  20.0       18  Male  104800.0

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         76 non-null     float64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      76 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 3.8+ KB

In [39]:
pd.options.display.max_rows

60

In [41]:
df.isnull().sum()

rank          0
discipline    0
phd           2
service       0
sex           0
salary        2
dtype: int64

In [42]:
df.dropna(inplace=True)

In [43]:
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[74 rows x 6 columns]

In [124]:
df.fillna("Error", inplace=True)
df.head(50)

         rank discipline   phd  service     sex    salary  salary2
0        Prof          B  56.0       49    Male  100000.0     True
1        Prof          A  12.0        6    Male   93000.0     True
2        Prof          A  23.0       20    Male  100000.0     True
3        Prof          A  40.0       31    Male  100000.0     True
4        Prof          B  20.0       18    Male  100000.0     True
5        Prof          A  20.0       20    Male  100000.0     True
6   AssocProf          A  20.0       17    Male   81285.0     True
8        Prof          A  29.0       19    Male   94350.0     True
9        Prof          A  51.0       51    Male   57800.0    False
10       Prof          B  39.0       33    Male  100000.0     True
11       Prof          B  23.0       23    Male  100000.0     True
12   AsstProf          B   1.0        0    Male   88000.0     True
14       Prof          B  25.0       19    Male  100000.0     True
15       Prof          B  17.0        3    Male  100000.0     True
16   AsstProf          B   8.0        3    Male   75044.0    False
17   AsstProf          B   4.0        0    Male   92000.0     True
18       Prof          A  19.0        7    Male  100000.0     True
19       Prof          A  29.0       27    Male  100000.0     True
20   AsstProf          B   4.0        4    Male   92000.0     True
21       Prof          A  33.0       30    Male  100000.0     True
22   AsstProf          A   4.0        2    Male   73000.0    False
23   AsstProf          A   2.0        0    Male   85000.0     True
24       Prof          A  30.0       23    Male   91100.0     True
25       Prof          B  35.0       31    Male   99418.0     True
26       Prof          A  38.0       19    Male  100000.0     True
27       Prof          A  45.0       43    Male  100000.0     True
29       Prof          B  21.0       20    Male  100000.0     True
30  AssocProf          B   9.0        7    Male  100000.0     True
31       Prof          B  22.0       21    Male  100000.0     True
32       Prof          A  27.0       19    Male  100000.0     True
33       Prof          B  18.0       18    Male  100000.0     True
35       Prof          B  28.0       23    Male  100000.0     True
36       Prof          B  45.0       45    Male  100000.0     True
37       Prof          A  20.0        8    Male  100000.0     True
38   AsstProf          B   4.0        3    Male   91000.0     True
39       Prof          B  18.0       18  Female  100000.0     True
40       Prof          A  39.0       36  Female  100000.0     True
41  AssocProf          A  13.0        8  Female   74830.0    False
42   AsstProf          B   4.0        2  Female   80225.0     True
43   AsstProf          B   5.0        0  Female   77000.0    False
44       Prof          B  23.0       19  Female  100000.0     True
45       Prof          B  25.0       25  Female  100000.0     True
46   AsstProf          B  11.0        3  Female   74692.0    False
47  AssocProf          B  11.0       11  Female  100000.0     True
48       Prof          B  17.0       17  Female  100000.0     True
49       Prof          B  17.0       18  Female  100000.0     True
50   AsstProf          B  10.0        5  Female   97032.0     True
51       Prof          B  20.0       14  Female  100000.0     True
52       Prof          A  12.0        0  Female  100000.0     True
53   AsstProf          A   5.0        3  Female   73500.0    False

In [46]:
df["salary"].fillna(45000, inplace=True)
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[74 rows x 6 columns]

In [48]:
for x in df.index:
    if df.loc[x, "salary"] > 100000:
        df.loc[x, "salary"] = 100000
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  100000.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  100000.0
3        Prof          A  40.0       31    Male  100000.0
4        Prof          B  20.0       18    Male  100000.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  100000.0
74  AssocProf          B  19.0        6  Female  100000.0
75       Prof          B  17.0       17  Female  100000.0
76       Prof          A  28.0       14  Female  100000.0
77       Prof          A  23.0       15  Female  100000.0

[74 rows x 6 columns]

In [55]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
      ...
73    False
74    False
75     True
76    False
77    False
Length: 74, dtype: bool

In [56]:
df.duplicated("salary").sum()

47

In [57]:
df.shape

(74, 6)

In [58]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [59]:
df['salary']

0     100000.0
1      93000.0
2     100000.0
3     100000.0
4     100000.0
        ...
73    100000.0
74    100000.0
75    100000.0
76    100000.0
77    100000.0
Name: salary, Length: 74, dtype: float64

In [60]:
df.head(3)

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  100000.0
1  Prof          A  12.0        6  Male   93000.0
2  Prof          A  23.0       20  Male  100000.0

In [61]:
df.tail(3)

    rank discipline   phd  service     sex    salary
75  Prof          B  17.0       17  Female  100000.0
76  Prof          A  28.0       14  Female  100000.0
77  Prof          A  23.0       15  Female  100000.0

In [62]:
df.sample(10)

        rank discipline   phd  service     sex    salary
66  AsstProf          A   7.0        6  Female   63100.0
35      Prof          B  28.0       23    Male  100000.0
36      Prof          B  45.0       45    Male  100000.0
22  AsstProf          A   4.0        2    Male   73000.0
29      Prof          B  21.0       20    Male  100000.0
25      Prof          B  35.0       31    Male   99418.0
23  AsstProf          A   2.0        0    Male   85000.0
37      Prof          A  20.0        8    Male  100000.0
8       Prof          A  29.0       19    Male   94350.0
52      Prof          A  12.0        0  Female  100000.0

In [63]:
df[['salary', 'phd', 'sex']]

      salary   phd     sex
0   100000.0  56.0    Male
1    93000.0  12.0    Male
2   100000.0  23.0    Male
3   100000.0  40.0    Male
4   100000.0  20.0    Male
..       ...   ...     ...
73  100000.0  18.0  Female
74  100000.0  19.0  Female
75  100000.0  17.0  Female
76  100000.0  28.0  Female
77  100000.0  23.0  Female

[74 rows x 3 columns]

In [64]:
df['salary'].mean()

92061.82432432432

In [65]:
df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [66]:
df['rank'].value_counts()

Prof         44
AsstProf     18
AssocProf    12
Name: rank, dtype: int64

In [72]:
salary2 = df['salary'] > 80000
df['salary2'] = salary2
df

         rank discipline   phd  service     sex    salary  salary2
0        Prof          B  56.0       49    Male  100000.0     True
1        Prof          A  12.0        6    Male   93000.0     True
2        Prof          A  23.0       20    Male  100000.0     True
3        Prof          A  40.0       31    Male  100000.0     True
4        Prof          B  20.0       18    Male  100000.0     True
..        ...        ...   ...      ...     ...       ...      ...
73       Prof          B  18.0       10  Female  100000.0     True
74  AssocProf          B  19.0        6  Female  100000.0     True
75       Prof          B  17.0       17  Female  100000.0     True
76       Prof          A  28.0       14  Female  100000.0     True
77       Prof          A  23.0       15  Female  100000.0     True

[74 rows x 7 columns]

In [77]:
x = (df['salary']<80000) & (df['sex'] == "Male")
df[x]

        rank discipline   phd  service   sex   salary  salary2
9       Prof          A  51.0       51  Male  57800.0    False
16  AsstProf          B   8.0        3  Male  75044.0    False
22  AsstProf          A   4.0        2  Male  73000.0    False

In [78]:
df.iloc[5:10, 0:3]

         rank discipline   phd
5        Prof          A  20.0
6   AssocProf          A  20.0
8        Prof          A  29.0
9        Prof          A  51.0
10       Prof          B  39.0

In [79]:
#Using titanic.csv file
df2 = pd.read_csv("training_titanic.csv")
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [80]:
df2.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [95]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [96]:
df2.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [97]:
df2.shape

(891, 12)

In [98]:
df2.duplicated().sum()

0

In [101]:
df2.drop_duplicates(inplace=True)
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [103]:
df2['Cabin'].value_counts()

G6             4
B96 B98        4
C23 C25 C27    4
F2             3
C22 C26        3
              ..
B37            1
C103           1
C118           1
E63            1
D21            1
Name: Cabin, Length: 147, dtype: int64

In [104]:
df2.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [105]:
df2.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [106]:
df2.iloc[:,:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [107]:
df2.iloc[:30, 0:5]

,PassengerId,Survived,Pclass,Name,Sex
0,1,0,3,"Braund, Mr. Owen Harris",male
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female
2,3,1,3,"Heikkinen, Miss. Laina",female
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female
4,5,0,3,"Allen, Mr. William Henry",male
5,6,0,3,"Moran, Mr. James",male
6,7,0,1,"McCarthy, Mr. Timothy J",male
7,8,0,3,"Palsson, Master. Gosta Leonard",male
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female
11,12,1,1,"Bonnell, Miss. Elizabeth",female
12,13,0,3,"Saundercock, Mr. William Henry",male
13,14,0,3,"Andersson, Mr. Anders Johan",male
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female
16,17,0,3,"Rice, Master. Eugene",male
17,18,1,2,"Williams, Mr. Charles Eugene",male
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female
19,20,1,3,"Masselmani, Mrs. Fatima",female
20,21,0,2,"Fynney, Mr. Joseph J",male
21,22,1,2,"Beesley, Mr. Lawrence",male
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female
23,24,1,1,"Sloper, Mr. William Thompson",male
24,25,0,3,"Palsson, Miss. Torborg Danira",female
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female
26,27,0,3,"Emir, Mr. Farred Chehab",male
27,28,0,1,"Fortune, Mr. Charles Alexander",male
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female
29,30,0,3,"Todoroff, Mr. Lalio",male

In [109]:
df2['Age'].fillna(df2['Age'].mean(), inplace=True)
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q

In [112]:
df2.dropna(inplace=True)
df2.shape

(202, 12)

In [119]:
print(df2.head(20).to_string())

     PassengerId  Survived  Pclass                                                 Name     Sex        Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
1              2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.000000      1      0     PC 17599   71.2833          C85        C
3              4         1       1         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.000000      1      0       113803   53.1000         C123        S
6              7         0       1                              McCarthy, Mr. Timothy J    male  54.000000      0      0        17463   51.8625          E46        S
10            11         1       3                      Sandstrom, Miss. Marguerite Rut  female   4.000000      1      1      PP 9549   16.7000           G6        S
11            12         1       1                             Bonnell, Miss. Elizabeth  female  58.000000      0      0       113783   26.5500         C103        S
21            22         1       2                                Beesley, Mr. Lawrence    male  34.000000      0      0       248698   13.0000          D56        S
23            24         1       1                         Sloper, Mr. William Thompson    male  28.000000      0      0       113788   35.5000           A6        S
27            28         0       1                       Fortune, Mr. Charles Alexander    male  19.000000      3      2        19950  263.0000  C23 C25 C27        S
31            32         1       1       Spencer, Mrs. William Augustus (Marie Eugenie)  female  29.699118      1      0     PC 17569  146.5208          B78        C
52            53         1       1             Harper, Mrs. Henry Sleeper (Myna Haxtun)  female  49.000000      1      0     PC 17572   76.7292          D33        C
54            55         0       1                       Ostby, Mr. Engelhart Cornelius    male  65.000000      0      1       113509   61.9792          B30        C
55            56         1       1                                    Woolner, Mr. Hugh    male  29.699118      0      0        19947   35.5000          C52        S
62            63         0       1                          Harris, Mr. Henry Birkhardt    male  45.000000      1      0        36973   83.4750          C83        S
66            67         1       2                         Nye, Mrs. (Elizabeth Ramell)  female  29.000000      0      0   C.A. 29395   10.5000          F33        S
75            76         0       3                              Moen, Mr. Sigurd Hansen    male  25.000000      0      0       348123    7.6500        F G73        S
88            89         1       1                           Fortune, Miss. Mabel Helen  female  23.000000      3      2        19950  263.0000  C23 C25 C27        S
92            93         0       1                          Chaffee, Mr. Herbert Fuller    male  46.000000      1      0  W.E.P. 5734   61.1750          E31        S
96            97         0       1                            Goldschmidt, Mr. George B    male  71.000000      0      0     PC 17754   34.6542           A5        C
97            98         1       1                      Greenfield, Mr. William Bertram    male  23.000000      0      1     PC 17759   63.3583      D10 D12        C
102          103         0       1                            White, Mr. Richard Frasar    male  21.000000      0      1        35281   77.2875          D26        S

In [120]:
df2.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
453,454,1,1,"Goldenberg, Mr. Samuel L",male,49.000000,1,0,17453,89.1042,C92,C
473,474,1,2,"Jerwan, Mrs. Amin S (Marie Marthe Thuillard)",female,23.000000,0,0,SC/AH Basle 541,13.7917,D,C
486,487,1,1,"Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)",female,35.000000,1,0,19943,90.0000,C93,S
839,840,1,1,"Marechal, Mr. Pierre",male,29.699118,0,0,11774,29.7000,C47,C
516,517,1,2,"Lemore, Mrs. (Amelia Milley)",female,34.000000,0,0,C.A. 34260,10.5000,F33,S
515,516,0,1,"Walker, Mr. William Anderson",male,47.000000,0,0,36967,34.0208,D46,S
627,628,1,1,"Longley, Miss. Gretchen Fiske",female,21.000000,0,0,13502,77.9583,D9,S
572,573,1,1,"Flynn, Mr. John Irwin (""Irving"")",male,36.000000,0,0,PC 17474,26.3875,E25,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.000000,0,1,PC 17759,63.3583,D10 D12,C

In [121]:
df2.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
849,850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,29.699118,1,0,17453,89.1042,C92,C
853,854,1,1,"Lines, Miss. Mary Conover",female,16.000000,0,1,PC 17592,39.4000,D28,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.000000,0,0,113055,26.5500,E17,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.000000,0,0,17466,25.9292,D17,S
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.000000,0,0,PC 17590,50.4958,A24,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.000000,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.000000,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.000000,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C

In [122]:
df2.iloc[10:20, :]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.000000,0,1,113509,61.9792,B30,C
55,56,1,1,"Woolner, Mr. Hugh",male,29.699118,0,0,19947,35.5000,C52,S
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.000000,1,0,36973,83.4750,C83,S
66,67,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.000000,0,0,C.A. 29395,10.5000,F33,S
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25.000000,0,0,348123,7.6500,F G73,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.000000,3,2,19950,263.0000,C23 C25 C27,S
92,93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.000000,1,0,W.E.P. 5734,61.1750,E31,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.000000,0,0,PC 17754,34.6542,A5,C
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.000000,0,1,PC 17759,63.3583,D10 D12,C
102,103,0,1,"White, Mr. Richard Frasar",male,21.000000,0,1,35281,77.2875,D26,S

In [123]:
df2.isnull().mean()

PassengerId    0.0
Survived       0.0
Pclass         0.0
Name           0.0
Sex            0.0
Age            0.0
SibSp          0.0
Parch          0.0
Ticket         0.0
Fare           0.0
Cabin          0.0
Embarked       0.0
dtype: float64